_src/wiki/2016-09-30-创建最小java8_Docker镜像.org
#+title: 创建最小Java8 Docker镜像
#+date: <2016-09-30 20:48>
#+filetags: java reprint

* 1. 参考 http://blog.csdn.NET/hknaruto/article/details/70229896 ，
构建一个最小 Linux Docker镜像
考虑到需要进入docker容器查看容器内部数据、状态，因此引用一个基础的linux镜像。如果没有此类需求也可以直接FROM scratch

* 2. www.Oracle.com下载jdk-8u101-linux-x64.tar.gz, 解压并得到其中的jre目录

* 3. 由于Java依赖了系统库，此处选择从官方centos7 docker镜像中抽取必要的系统库文件，
   操作过程如下

** 3.1 建立镜像制作目录
: mkdir minos-jre8

** 3.2 建立系统库目录
: mkdir usr/lib64

** 3.3 从官方的centos7镜像中启动一个容器
#+BEGIN_EXAMPLE
[yeqiang@localhost minos-jre8]$ docker run --rm -it centos /bin/bash
[root@6d37aa8a73c9/]#
#+END_EXAMPLE

* 3.4 打开一个新的终端，从容器中拷贝系统库到镜像制作目录下的usr/lib64内
#+BEGIN_EXAMPLE
docker cp 6d37aa8a73c9:/lib64/ld-linux-x86-64.so.2  usr/lib64/ld-linux-x86-64.so.2
docker cp 6d37aa8a73c9:/lib64/libc.so.6  usr/lib64/libc.so.6
docker cp 6d37aa8a73c9:/lib64/libdl.so.2  usr/lib64/libdl.so.2
docker cp 6d37aa8a73c9:/lib64/libffi.so.6  usr/lib64/libffi.so.6
docker cp 6d37aa8a73c9:/lib64/libgcc_s.so.1  usr/lib64/libgcc_s.so.1
docker cp 6d37aa8a73c9:/lib64/libgio-2.0.so.0  usr/lib64/libgio-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libglib-2.0.so.0  usr/lib64/libglib-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libgmodule-2.0.so.0  usr/lib64/libgmodule-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libgobject-2.0.so.0  usr/lib64/libgobject-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libgthread-2.0.so.0  usr/lib64/libgthread-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/liblzma.so.5  usr/lib64/liblzma.so.5
docker cp 6d37aa8a73c9:/lib64/libm.so.6  usr/lib64/libm.so.6
docker cp 6d37aa8a73c9:/lib64/libnsl.so.1  usr/lib64/libnsl.so.1
docker cp 6d37aa8a73c9:/lib64/libpcre.so.1  usr/lib64/libpcre.so.1
docker cp 6d37aa8a73c9:/lib64/libpthread.so.0  usr/lib64/libpthread.so.0
docker cp 6d37aa8a73c9:/lib64/libresolv.so.2  usr/lib64/libresolv.so.2
docker cp 6d37aa8a73c9:/lib64/librt.so.1  usr/lib64/librt.so.1
docker cp 6d37aa8a73c9:/lib64/libselinux.so.1  usr/lib64/libselinux.so.1
docker cp 6d37aa8a73c9:/lib64/libstdc++.so.6  usr/lib64/libstdc++.so.6
docker cp 6d37aa8a73c9:/lib64/libthread_db.so.1  usr/lib64/libthread_db.so.1
docker cp 6d37aa8a73c9:/lib64/libxml2.so.2  usr/lib64/libxml2.so.2
docker cp 6d37aa8a73c9:/lib64/libz.so.1  usr/lib64/libz.so.1


docker cp 6d37aa8a73c9:/lib64/ld-2.17.so usr/lib64/ld-2.17.so
docker cp 6d37aa8a73c9:/lib64/libc-2.17.so usr/lib64/libc-2.17.so
docker cp 6d37aa8a73c9:/lib64/libdl-2.17.so usr/lib64/libdl-2.17.so
docker cp 6d37aa8a73c9:/lib64/libffi.so.6.0.1 usr/lib64/libffi.so.6.0.1
docker cp 6d37aa8a73c9:/lib64/libgcc_s-4.8.5-20150702.so.1 usr/lib64/libgcc_s-4.8.5-20150702.so.1
docker cp 6d37aa8a73c9:/lib64/libgio-2.0.so.0.4200.2 usr/lib64/libgio-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libglib-2.0.so.0.4200.2 usr/lib64/libglib-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libgmodule-2.0.so.0.4200.2 usr/lib64/libgmodule-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libgobject-2.0.so.0.4200.2 usr/lib64/libgobject-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libgthread-2.0.so.0.4200.2 usr/lib64/libgthread-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/liblzma.so.5.0.99 usr/lib64/liblzma.so.5.0.99
docker cp 6d37aa8a73c9:/lib64/libm-2.17.so usr/lib64/libm-2.17.so
docker cp 6d37aa8a73c9:/lib64/libnsl-2.17.so usr/lib64/libnsl-2.17.so
docker cp 6d37aa8a73c9:/lib64/libpcre.so.1.2.0 usr/lib64/libpcre.so.1.2.0
docker cp 6d37aa8a73c9:/lib64/libpthread-2.17.so usr/lib64/libpthread-2.17.so
docker cp 6d37aa8a73c9:/lib64/libresolv-2.17.so usr/lib64/libresolv-2.17.so
docker cp 6d37aa8a73c9:/lib64/librt-2.17.so usr/lib64/librt-2.17.so
docker cp 6d37aa8a73c9:/lib64/libstdc++.so.6.0.19 usr/lib64/libstdc++.so.6.0.19
docker cp 6d37aa8a73c9:/lib64/libthread_db-1.0.so usr/lib64/libthread_db-1.0.so
docker cp 6d37aa8a73c9:/lib64/libxml2.so.2.9.1 usr/lib64/libxml2.so.2.9.1
docker cp 6d37aa8a73c9:/lib64/libz.so.1.2.7 usr/lib64/libz.so.1.2.7

#+END_EXAMPLE


说明：为什么知道拷贝这些文件？

将jre拷贝到docker 容器内，然后通过ldd指令检查bin目录下java等可执行程序及lib目录
下的动态库获得库列表。如(注意应该通过find 扫描所有文件利用正则表达式产生上述指令。
CentOS7没有的一些库不用处理。)

#+BEGIN_EXAMPLE
# ldd java
    linux-vdso.so.1 =>  (0x00007ffccdda9000)
    libpthread.so.0 => /lib64/libpthread.so.0 (0x00007f42a4389000)
    libjli.so => /usr/local/jdk1.8.0_101/jre/bin/./../lib/amd64/jli/libjli.so (0x00007f42a4172000)
    libdl.so.2 => /lib64/libdl.so.2 (0x00007f42a3f6e000)
    libc.so.6 => /lib64/libc.so.6 (0x00007f42a3bad000)
    /lib64/ld-linux-x86-64.so.2 (0x000055a2ffc8c000)

#+END_EXAMPLE

* 4. 建立 =usr/local/jdk1.8.0_101/= 目录，并拷贝解压出来的jre目录到 =jdk1.8.0_101/= 下
#+BEGIN_EXAMPLE
mkdir usr/local/jdk1.8.0_101/  -p
cp /tmp/jdk1.8.0_101/ jre usr/local/jdk1.8.0_101/ -r

#+END_EXAMPLE

* 5.  创建Dockerfile，内容如下：
#+BEGIN_SRC
# the minimal os support oracle java8 based on offical docker centos7 x64 libs
FROM minos
MAINTAINER YeQiang
ADD ./ /
ENV JAVA_HOME /usr/local/jdk1.8.0_101/jre
ENV PATH $PATH:$JAVA_HOME/bin
RUN rm /Dockerfile

#+END_SRC

