wiki/2016-09-30-创建最小java8_Docker镜像.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>创建最小Java8 Docker镜像</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">创建最小Java8 Docker镜像</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> <a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-09-30</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org981dcba">1. 参考 http://blog.csdn.NET/hknaruto/article/details/70229896 ，</a></li>
<li><a href="#org5f9fdc5">2. www.Oracle.com下载jdk-8u101-linux-x64.tar.gz, 解压并得到其中的jre目录</a></li>
<li><a href="#org1997a6e">3. 由于Java依赖了系统库，此处选择从官方centos7 docker镜像中抽取必要的系统库文件，</a>
<ul>
<li><a href="#org49d5405">3.1 建立镜像制作目录</a></li>
<li><a href="#org40cd39a">3.2 建立系统库目录</a></li>
<li><a href="#org2212ed7">3.3 从官方的centos7镜像中启动一个容器</a></li>
</ul>
</li>
<li><a href="#org9eeed7a">3.4 打开一个新的终端，从容器中拷贝系统库到镜像制作目录下的usr/lib64内</a></li>
<li><a href="#orge052237">4. 建立 <code>usr/local/jdk1.8.0_101/</code> 目录，并拷贝解压出来的jre目录到 <code>jdk1.8.0_101/</code> 下</a></li>
<li><a href="#orgec5d9b4">5.  创建Dockerfile，内容如下：</a></li>
<li><a href="#org879a421">6. 此时镜像目录文件结构如下</a></li>
<li><a href="#org27b7e13">7. 制作镜像</a></li>
<li><a href="#org7b4d6d0">8. 查看docker镜像</a></li>
<li><a href="#org81b878c">9. 测试</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org981dcba" class="outline-2">
<h2 id="org981dcba">1. 参考 <a href="http://blog.csdn.net/hknaruto/article/details/70229896">http://blog.csdn.net/hknaruto/article/details/70229896</a> ，</h2>
<div class="outline-text-2" id="text-org981dcba">
<p>
构建一个最小 Linux Docker镜像
考虑到需要进入docker容器查看容器内部数据、状态，因此引用一个基础的linux镜像。如果没有此类需求也可以直接FROM scratch
</p>
</div>
</div>

<div id="outline-container-org5f9fdc5" class="outline-2">
<h2 id="org5f9fdc5">2. www.Oracle.com下载jdk-8u101-linux-x64.tar.gz, 解压并得到其中的jre目录</h2>
</div>

<div id="outline-container-org1997a6e" class="outline-2">
<h2 id="org1997a6e">3. 由于Java依赖了系统库，此处选择从官方centos7 docker镜像中抽取必要的系统库文件，</h2>
<div class="outline-text-2" id="text-org1997a6e">
<p>
操作过程如下
</p>
</div>

<div id="outline-container-org49d5405" class="outline-3">
<h3 id="org49d5405">3.1 建立镜像制作目录</h3>
<div class="outline-text-3" id="text-org49d5405">
<pre class="example">
mkdir minos-jre8

</pre>
</div>
</div>

<div id="outline-container-org40cd39a" class="outline-3">
<h3 id="org40cd39a">3.2 建立系统库目录</h3>
<div class="outline-text-3" id="text-org40cd39a">
<pre class="example">
mkdir usr/lib64

</pre>
</div>
</div>

<div id="outline-container-org2212ed7" class="outline-3">
<h3 id="org2212ed7">3.3 从官方的centos7镜像中启动一个容器</h3>
<div class="outline-text-3" id="text-org2212ed7">
<pre class="example">
[yeqiang@localhost minos-jre8]$ docker run --rm -it centos /bin/bash
[root@6d37aa8a73c9/]#
</pre>
</div>
</div>
</div>

<div id="outline-container-org9eeed7a" class="outline-2">
<h2 id="org9eeed7a">3.4 打开一个新的终端，从容器中拷贝系统库到镜像制作目录下的usr/lib64内</h2>
<div class="outline-text-2" id="text-org9eeed7a">
<pre class="example">
docker cp 6d37aa8a73c9:/lib64/ld-linux-x86-64.so.2  usr/lib64/ld-linux-x86-64.so.2
docker cp 6d37aa8a73c9:/lib64/libc.so.6  usr/lib64/libc.so.6
docker cp 6d37aa8a73c9:/lib64/libdl.so.2  usr/lib64/libdl.so.2
docker cp 6d37aa8a73c9:/lib64/libffi.so.6  usr/lib64/libffi.so.6
docker cp 6d37aa8a73c9:/lib64/libgcc_s.so.1  usr/lib64/libgcc_s.so.1
docker cp 6d37aa8a73c9:/lib64/libgio-2.0.so.0  usr/lib64/libgio-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libglib-2.0.so.0  usr/lib64/libglib-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libgmodule-2.0.so.0  usr/lib64/libgmodule-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libgobject-2.0.so.0  usr/lib64/libgobject-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/libgthread-2.0.so.0  usr/lib64/libgthread-2.0.so.0
docker cp 6d37aa8a73c9:/lib64/liblzma.so.5  usr/lib64/liblzma.so.5
docker cp 6d37aa8a73c9:/lib64/libm.so.6  usr/lib64/libm.so.6
docker cp 6d37aa8a73c9:/lib64/libnsl.so.1  usr/lib64/libnsl.so.1
docker cp 6d37aa8a73c9:/lib64/libpcre.so.1  usr/lib64/libpcre.so.1
docker cp 6d37aa8a73c9:/lib64/libpthread.so.0  usr/lib64/libpthread.so.0
docker cp 6d37aa8a73c9:/lib64/libresolv.so.2  usr/lib64/libresolv.so.2
docker cp 6d37aa8a73c9:/lib64/librt.so.1  usr/lib64/librt.so.1
docker cp 6d37aa8a73c9:/lib64/libselinux.so.1  usr/lib64/libselinux.so.1
docker cp 6d37aa8a73c9:/lib64/libstdc++.so.6  usr/lib64/libstdc++.so.6
docker cp 6d37aa8a73c9:/lib64/libthread_db.so.1  usr/lib64/libthread_db.so.1
docker cp 6d37aa8a73c9:/lib64/libxml2.so.2  usr/lib64/libxml2.so.2
docker cp 6d37aa8a73c9:/lib64/libz.so.1  usr/lib64/libz.so.1


docker cp 6d37aa8a73c9:/lib64/ld-2.17.so usr/lib64/ld-2.17.so
docker cp 6d37aa8a73c9:/lib64/libc-2.17.so usr/lib64/libc-2.17.so
docker cp 6d37aa8a73c9:/lib64/libdl-2.17.so usr/lib64/libdl-2.17.so
docker cp 6d37aa8a73c9:/lib64/libffi.so.6.0.1 usr/lib64/libffi.so.6.0.1
docker cp 6d37aa8a73c9:/lib64/libgcc_s-4.8.5-20150702.so.1 usr/lib64/libgcc_s-4.8.5-20150702.so.1
docker cp 6d37aa8a73c9:/lib64/libgio-2.0.so.0.4200.2 usr/lib64/libgio-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libglib-2.0.so.0.4200.2 usr/lib64/libglib-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libgmodule-2.0.so.0.4200.2 usr/lib64/libgmodule-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libgobject-2.0.so.0.4200.2 usr/lib64/libgobject-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/libgthread-2.0.so.0.4200.2 usr/lib64/libgthread-2.0.so.0.4200.2
docker cp 6d37aa8a73c9:/lib64/liblzma.so.5.0.99 usr/lib64/liblzma.so.5.0.99
docker cp 6d37aa8a73c9:/lib64/libm-2.17.so usr/lib64/libm-2.17.so
docker cp 6d37aa8a73c9:/lib64/libnsl-2.17.so usr/lib64/libnsl-2.17.so
docker cp 6d37aa8a73c9:/lib64/libpcre.so.1.2.0 usr/lib64/libpcre.so.1.2.0
docker cp 6d37aa8a73c9:/lib64/libpthread-2.17.so usr/lib64/libpthread-2.17.so
docker cp 6d37aa8a73c9:/lib64/libresolv-2.17.so usr/lib64/libresolv-2.17.so
docker cp 6d37aa8a73c9:/lib64/librt-2.17.so usr/lib64/librt-2.17.so
docker cp 6d37aa8a73c9:/lib64/libstdc++.so.6.0.19 usr/lib64/libstdc++.so.6.0.19
docker cp 6d37aa8a73c9:/lib64/libthread_db-1.0.so usr/lib64/libthread_db-1.0.so
docker cp 6d37aa8a73c9:/lib64/libxml2.so.2.9.1 usr/lib64/libxml2.so.2.9.1
docker cp 6d37aa8a73c9:/lib64/libz.so.1.2.7 usr/lib64/libz.so.1.2.7

</pre>


<p>
说明：为什么知道拷贝这些文件？
</p>

<p>
将jre拷贝到docker 容器内，然后通过ldd指令检查bin目录下java等可执行程序及lib目录
下的动态库获得库列表。如(注意应该通过find 扫描所有文件利用正则表达式产生上述指令。
CentOS7没有的一些库不用处理。)
</p>

<pre class="example">
# ldd java
    linux-vdso.so.1 =&gt;  (0x00007ffccdda9000)
    libpthread.so.0 =&gt; /lib64/libpthread.so.0 (0x00007f42a4389000)
    libjli.so =&gt; /usr/local/jdk1.8.0_101/jre/bin/./../lib/amd64/jli/libjli.so (0x00007f42a4172000)
    libdl.so.2 =&gt; /lib64/libdl.so.2 (0x00007f42a3f6e000)
    libc.so.6 =&gt; /lib64/libc.so.6 (0x00007f42a3bad000)
    /lib64/ld-linux-x86-64.so.2 (0x000055a2ffc8c000)

</pre>
</div>
</div>

<div id="outline-container-orge052237" class="outline-2">
<h2 id="orge052237">4. 建立 <code>usr/local/jdk1.8.0_101/</code> 目录，并拷贝解压出来的jre目录到 <code>jdk1.8.0_101/</code> 下</h2>
<div class="outline-text-2" id="text-orge052237">
<pre class="example">
mkdir usr/local/jdk1.8.0_101/  -p
cp /tmp/jdk1.8.0_101/ jre usr/local/jdk1.8.0_101/ -r

</pre>
</div>
</div>

<div id="outline-container-orgec5d9b4" class="outline-2">
<h2 id="orgec5d9b4">5.  创建Dockerfile，内容如下：</h2>
<div class="outline-text-2" id="text-orgec5d9b4">
<pre class="example">
# the minimal os support oracle java8 based on offical docker centos7 x64 libs
FROM minos
MAINTAINER YeQiang
ADD ./ /
ENV JAVA_HOME /usr/local/jdk1.8.0_101/jre
ENV PATH $PATH:$JAVA_HOME/bin
RUN rm /Dockerfile

</pre>
</div>
</div>
