_src/wiki/2016-09-30-创建最小java8_Docker镜像.org
* 7. 制作镜像
#+BEGIN_EXAMPLE
[yeqiang@localhost minos-jre8]$ docker build -t minos-jre8 .
Sending build context to Docker daemon 205.1 MB
Step 1 : FROM minos
 ---> c43240f48fba
Step 2 : MAINTAINER YeQiang
 ---> Using cache
 ---> 4b2549a55f33
Step 3 : ADD ./ /
 ---> Using cache
 ---> 1203a5df3aed
Step 4 : ENV JAVA_HOME /usr/local/jdk1.8.0_101/jre
 ---> Using cache
 ---> ff5daf29c0e9
Step 5 : ENV PATH $PATH:$JAVA_HOME/bin
 ---> Using cache
 ---> 23fcec942716
Step 6 : RUN rm /Dockerfile
 ---> Using cache
 ---> baf8d9215326
Successfully built 5508ca0bbd8f

#+END_EXAMPLE


* 8. 查看docker镜像
#+BEGIN_EXAMPLE
[yeqiang@localhost minos-jre8]$ docker images | grep jre8
minos-jre8                           latest              c3d6c030f3c3        About a minute ago   205.8 MB

#+END_EXAMPLE

对比在CentOS系统上构建的包含完整jdk版本大小：
: java               8                   5abc8862a3d4        3 months ago        577.4 MB

* 9. 测试
#+BEGIN_EXAMPLE
[yeqiang@localhost minos-jre8]$ docker run --rm -it minos-jre8 java -version
java version "1.8.0_101"
Java(TM) SE Runtime Environment (build 1.8.0_101-b13)
Java HotSpot(TM) 64-Bit Server VM (build 25.101-b13, mixed mode)

#+END_EXAMPLE
