wiki/2016-09-30-创建最小java8_Docker镜像.html


<div id="outline-container-org27b7e13" class="outline-2">
<h2 id="org27b7e13">7. 制作镜像</h2>
<div class="outline-text-2" id="text-org27b7e13">
<pre class="example">
[yeqiang@localhost minos-jre8]$ docker build -t minos-jre8 .
Sending build context to Docker daemon 205.1 MB
Step 1 : FROM minos
 ---&gt; c43240f48fba
Step 2 : MAINTAINER YeQiang
 ---&gt; Using cache
 ---&gt; 4b2549a55f33
Step 3 : ADD ./ /
 ---&gt; Using cache
 ---&gt; 1203a5df3aed
Step 4 : ENV JAVA_HOME /usr/local/jdk1.8.0_101/jre
 ---&gt; Using cache
 ---&gt; ff5daf29c0e9
Step 5 : ENV PATH $PATH:$JAVA_HOME/bin
 ---&gt; Using cache
 ---&gt; 23fcec942716
Step 6 : RUN rm /Dockerfile
 ---&gt; Using cache
 ---&gt; baf8d9215326
Successfully built 5508ca0bbd8f

</pre>
</div>
</div>


<div id="outline-container-org7b4d6d0" class="outline-2">
<h2 id="org7b4d6d0">8. 查看docker镜像</h2>
<div class="outline-text-2" id="text-org7b4d6d0">
<pre class="example">
[yeqiang@localhost minos-jre8]$ docker images | grep jre8
minos-jre8                           latest              c3d6c030f3c3        About a minute ago   205.8 MB

</pre>

<p>
对比在CentOS系统上构建的包含完整jdk版本大小：
</p>
<pre class="example">
java               8                   5abc8862a3d4        3 months ago        577.4 MB

</pre>
</div>
</div>

<div id="outline-container-org81b878c" class="outline-2">
<h2 id="org81b878c">9. 测试</h2>
<div class="outline-text-2" id="text-org81b878c">
<pre class="example">
[yeqiang@localhost minos-jre8]$ docker run --rm -it minos-jre8 java -version
java version "1.8.0_101"
Java(TM) SE Runtime Environment (build 1.8.0_101-b13)
Java HotSpot(TM) 64-Bit Server VM (build 25.101-b13, mixed mode)

</pre>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
